# Задачи блока «цикл for»

## Задача 1

Напишите программу, которая считывает с клавиатуры два числа `a` и `b`, считает и выводит на консоль среднее арифметическое всех чисел из отрезка `[a; b]`, которые кратны числу `3`.

В приведенном ниже примере среднее арифметическое считается для чисел на отрезке `[-5; 12]`. Всего чисел, делящихся на `3`, на этом отрезке `6`: `-3, 0, 3, 6, 9, 12`. Их среднее арифметическое равно `4.5`.

На вход программе подаются интервалы, внутри которых всегда есть хотя бы одно число, которое делится на `3`.

### Примитивное решение

```python
a, b = [int(input()) for i in range(2)]
mean = 0
count = 0
for num in range(a, b + 1):
    if num % 3 == 0:
        mean += num
        count += 1
mean /= count
print(mean)
```

### Математическое решение
```python
a, b = int(input()), int(input())
a = a + (-a % 3)
b = b - (b % 3)
print((a + b) / 2)
```

Подробное объяснение:  
1. [Деление с остатком отрицательных чисел](https://skysmart.ru/articles/mathematic/delenie-chisel-s-ostatkom)
